{
  "_name_or_path": "distilbert/distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "joy",
    "1": "sadness",
    "2": "anger",
    "3": "fear",
    "4": "love",
    "5": "suprise"
  },
  "initializer_range": 0.02,
  "label2id": {
    "anger": 2,
    "fear": 3,
    "joy": 0,
    "love": 4,
    "sadness": 1,
    "suprise": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.48.2",
  "vocab_size": 30522
}
